Revit 2024 API
BuiltInFailures.ScheduleViewFailures.CustomFieldNecessaryIdDeleted Property
 An element that is needed to compute the field [field name] from [schedule name] schedule was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CustomFieldNecessaryIdDeleted { get; }
Visual Basic
Public Shared ReadOnly Property CustomFieldNecessaryIdDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CustomFieldNecessaryIdDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace